Conf.Simple/src/Documents/SUI_ДокументОбмена/SUI_ДокументОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SUI_ДокументОбмена</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.SUI_ДополнительныеРеквизитыДокументовОбмена</registerRecords>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерДокументаОснования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДокументаОснования</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>Идентификатор Simple</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>69</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ШтрихкодДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПризнакМаркировки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.SUI_ТипыДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСостояния</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецСостояния</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерии</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПризнакМаркировки</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПлан</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПроизводства</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ГоденДо</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоФакт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШтрихкодыУпаковок</name>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <comment>Уникальный идентификатор строки</comment>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <comment>Ключ связи со строкой табличной части документа 1С</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>64</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеШтрихкода</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШтрихкодУпаковки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>69</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусОбработки</name>
      <type>
        <types>EnumRef.SUI_СтатусыОбработкиСтрок</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Conf.Simple/src/InformationRegisters/SUI_ВладельцыНастроекДокументов/SUI_ВладельцыНастроекДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SUI_ВладельцыНастроекДокументов</name>
  <dimensions>
    <name>НастройкаДокумента</name>
    <type>
      <types>CatalogRef.SUI_НастройкиДокументовОбмена</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МобильноеУстройство</name>
    <type>
      <types>ExchangePlanRef.SUI_МобильныеУстройства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/SUI_НастройкиДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументовОбмена</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументОбменаПриЗаписиДокумента1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекОтбораДокументов</name>
    <comment>Настройки компоновки данных содержащие элементы отбора</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекРеквизитовДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиТаблиц</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьНеЗаполненные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеНастроекРеквизитовТаблицы</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработкиСтрокЗагрузкиДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаЗаполнениеРеквизитов</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаСозданиеДокументовНаОсновании</name>
    <attributes>
      <name>ИмяДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработчик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиИдентификацииСтрок</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Documents/SUI_ДокументОбмена/Forms/ФормаВыборИзДерева/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДокументОснование = Параметры.ДокументОснование;
	ВыборТолькоДокументыОбмена = Параметры.ВыборТолькоДокументыОбмена;
	
	СостоянияДокументовОбмена = Параметры.СостоянияДокументовОбмена;
	ИсключаемыеСостоянияДокументовОбмена = Параметры.ИсключаемыеСостоянияДокументовОбмена;
	
	ДокументОбмена = Параметры.ДокументОбмена;
	ОбязателенВыборМобильныхУстройств = Параметры.ОбязателенВыборМобильныхУстройств;
	
	ВыборОдного = Параметры.ВыборОдного;
	АвтоВыбор = Параметры.АвтоВыбор;
	
	Заголовок = Параметры.Заголовок;
	
	Если ПустаяСтрока(Заголовок) Тогда
		Заголовок = НСтр("ru = 'Выбор настроек и документов обмена'")
	КонецЕсли;
	
	Элементы.ГруппаВладельцыНастроекДокументов.Видимость = Параметры.ВыборМобильныхУстройств И Не ВыборТолькоДокументыОбмена;
	Элементы.ДеревоВыборДанных.Ширина = ?(Элементы.ГруппаВладельцыНастроекДокументов.Видимость, 0, 70);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.ДлительнаяОперацияИнформация.Заголовок = НСтр("ru = 'Выполняется получение данных'");
	Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаДлительнаяОперация;
	
	ПодключитьОбработчикОжидания("НачатьЗагрузкуДанныхПриОткрытии", 0.1, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДеревоВыборДанных

&НаКлиенте
Процедура ДеревоВыборДанныхПриАктивизацииСтроки(Элемент)
	
	ОтборСтрокМобильныхУстройств = Новый Структура();
	
	Если Элементы.ДеревоВыборДанных.ТекущиеДанные = Неопределено Тогда
		ОтборСтрокМобильныхУстройств.Вставить("НастройкаДокумента", ПредопределенноеЗначение("Справочник.SUI_НастройкиДокументовОбмена.ПустаяСсылка"));
	Иначе
		ОтборСтрокМобильныхУстройств.Вставить("НастройкаДокумента", Элементы.ДеревоВыборДанных.ТекущиеДанные.НастройкаДокумента);
	КонецЕсли;
	
	Элементы.ВладельцыНастроекДокументов.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрокМобильныхУстройств);
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоВыборДанныхПометкаПриИзменении(Элемент)
	
	Если Элементы.ДеревоВыборДанных.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементДанных = ДеревоВыборДанных.НайтиПоИдентификатору(Элементы.ДеревоВыборДанных.ТекущаяСтрока);
	
	Пометка = ЭлементДанных.Пометка % 2;
	
	Если ВыборОдного И Пометка > 0 Тогда
		СнятьВсеПометкиДереваВыбора(ДеревоВыборДанных);
	КонецЕсли;
	
	ЭлементДанных.Пометка = Пометка;
	
	ПроставитьПометкиВниз(ЭлементДанных);
	ПроставитьПометкиВверх(ЭлементДанных);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьВсеМобильныеУстройства(Команда)
	
	УстановитьФлажкиМобильныеУстройства(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеМобильныеУстройства(Команда)
	
	УстановитьФлажкиМобильныеУстройства(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыбрать(Команда)
	
	ЗакрытьСВыбором();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура НачатьЗагрузкуДанныхПриОткрытии() Экспорт
	
	НачатьЗагрузкуДанныхПриОткрытииНаСервере();
	
	ЭлементыДеревоВыборДанных = ДеревоВыборДанных.ПолучитьЭлементы();
	
	Если ЭлементыДеревоВыборДанных.Количество() = 0 Тогда
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаЗаглушка;
		
		Если ВыборТолькоДокументыОбмена Тогда
			ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Отсутствуют документы обмена для выполнения операции:
			|%1'"), Заголовок)
		Иначе
			ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Отсутствуют настройки документов обмена для выполнения операции:
			|%1'"), Заголовок);
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ЗакрытьПослеПредупреждения", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение, ТекстПредупреждения);
		
	Иначе
		
		ОбработкаАвтоВыбор();
		
		Если ЭлементыДеревоВыборДанных.Количество() = 1 И ЭлементыДеревоВыборДанных[0].ПолучитьЭлементы().Количество() < 2 Тогда
			
			ЭлементыДеревоВыборДанных[0].Пометка = 1;
			
			ПроставитьПометкиВниз(ЭлементыДеревоВыборДанных[0]);
			ПроставитьПометкиВверх(ЭлементыДеревоВыборДанных[0]);
			
		КонецЕсли;
		
		Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаВыборДанных;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура НачатьЗагрузкуДанныхПриОткрытииНаСервере()
	
	Запрос = Новый Запрос;
	
	Если ВыборТолькоДокументыОбмена Тогда
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	НастройкиДокументов.Ссылка КАК НастройкаДокумента,
			|	НастройкиДокументов.Представление КАК НастройкаДокументаПредставление,
			|	ВЫБОР
			|		КОГДА НастройкиДокументов.ПометкаУдаления
			|			ТОГДА 4
			|		КОГДА НЕ НастройкиДокументов.Используется
			|			ТОГДА 8
			|		ИНАЧЕ 3
			|	КОНЕЦ КАК НастройкаДокументаИндексКартинки,
			|	ДокументыОбмена.Ссылка КАК ДокументОбмена,
			|	ДокументыОбмена.Представление КАК ДокументОбменаПредставление,
			|	ВЫБОР
			|		КОГДА ДокументыОбмена.Проведен
			|			ТОГДА 14
			|		КОГДА ДокументыОбмена.ПометкаУдаления
			|			ТОГДА 13
			|		ИНАЧЕ 12
			|	КОНЕЦ КАК ДокументОбменаИндексКартинки
			|ИЗ
			|	Документ.SUI_ДокументОбмена КАК ДокументыОбмена
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.SUI_НастройкиДокументовОбмена КАК НастройкиДокументов
			|		ПО ДокументыОбмена.НастройкаДокумента = НастройкиДокументов.Ссылка
			|ГДЕ
			|	ВЫБОР
			|		КОГДА &ДокументОбмена <> НЕОПРЕДЕЛЕНО
			|			ТОГДА ДокументыОбмена.Ссылка = &ДокументОбмена
			|		КОГДА &ДокументОснование <> НЕОПРЕДЕЛЕНО
			|			ТОГДА ДокументыОбмена.ДокументОснование = &ДокументОснование
			|		ИНАЧЕ ЛОЖЬ
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &ОтборПоСостоянию
			|			ТОГДА ДокументыОбмена.Состояние В (&СостоянияДокументовОбмена)
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ
			|	И ВЫБОР
			|		КОГДА &ОтборПоИсключаемымСостояниям
			|			ТОГДА НЕ ДокументыОбмена.Состояние В (&ИсключаемыеСостоянияДокументовОбмена)
			|		ИНАЧЕ ИСТИНА
			|	КОНЕЦ
			|ИТОГИ
			|ПО
			|	НастройкаДокумента";
		
	Иначе
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	НастройкиДокументов.Ссылка КАК НастройкаДокумента,
			|	НастройкиДокументов.Представление КАК НастройкаДокументаПредставление,
			|	ВЫБОР
			|		КОГДА НастройкиДокументов.ПометкаУдаления
			|			ТОГДА 4
			|		КОГДА НЕ НастройкиДокументов.Используется
			|			ТОГДА 8
			|		ИНАЧЕ 3
			|	КОНЕЦ КАК НастройкаДокументаИндексКартинки,
			|	ЕСТЬNULL(ДокументыОбмена.Ссылка, ЗНАЧЕНИЕ(Документ.SUI_ДокументОбмена.ПустаяСсылка)) КАК ДокументОбмена,
			|	ЕСТЬNULL(ДокументыОбмена.Представление, """") КАК ДокументОбменаПредставление,
			|	ЕСТЬNULL(ВЫБОР
			|		КОГДА ДокументыОбмена.Проведен
			|			ТОГДА 14
			|		КОГДА ДокументыОбмена.ПометкаУдаления
			|			ТОГДА 13
			|		ИНАЧЕ 12
			|	КОНЕЦ, 12) КАК ДокументОбменаИндексКартинки
			|ИЗ
			|	Справочник.SUI_НастройкиДокументовОбмена КАК НастройкиДокументов
			|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.SUI_ДокументОбмена КАК ДокументыОбмена
			|		ПО ДокументыОбмена.НастройкаДокумента = НастройкиДокументов.Ссылка
			|		И ВЫБОР
			|			КОГДА &ДокументОбмена <> НЕОПРЕДЕЛЕНО
			|				ТОГДА ДокументыОбмена.Ссылка = &ДокументОбмена
			|			КОГДА &ДокументОснование <> НЕОПРЕДЕЛЕНО
			|				ТОГДА ДокументыОбмена.ДокументОснование = &ДокументОснование
			|			ИНАЧЕ ЛОЖЬ
			|		КОНЕЦ
			|		И ВЫБОР
			|			КОГДА &ОтборПоСостоянию
			|				ТОГДА ДокументыОбмена.Состояние В (&СостоянияДокументовОбмена)
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|		И ВЫБОР
			|			КОГДА &ОтборПоИсключаемымСостояниям
			|				ТОГДА НЕ ДокументыОбмена.Состояние В (&ИсключаемыеСостоянияДокументовОбмена)
			|			ИНАЧЕ ИСТИНА
			|		КОНЕЦ
			|ГДЕ
			|	НастройкиДокументов.Ссылка В (&НастройкиДокументов)
			|ИТОГИ
			|ПО
			|	НастройкаДокумента";
		
		Если ЗначениеЗаполнено(ДокументОбмена) Тогда
			Запрос.УстановитьПараметр("НастройкиДокументов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбмена, "НастройкаДокумента")));
		ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда
			Запрос.УстановитьПараметр("НастройкиДокументов", Справочники.SUI_НастройкиДокументовОбмена.НастройкиПоДокументу(ДокументОснование));
		Иначе
			Запрос.УстановитьПараметр("НастройкиДокументов", Новый Массив());
		КонецЕсли;
		
	КонецЕсли;
	
	Если Элементы.ГруппаВладельцыНастроекДокументов.Видимость Тогда
		
		Запрос.Текст = Запрос.Текст + ОбщегоНазначения.РазделительПакетаЗапросов() + "
		|ВЫБРАТЬ
		|	ЛОЖЬ КАК Пометка,
		|	ВладельцыНастроекДокументов.НастройкаДокумента,
		|	ВладельцыНастроекДокументов.МобильноеУстройство,
		|	ВЫБОР
		|		КОГДА ВладельцыНастроекДокументов.МобильноеУстройство.ПометкаУдаления
		|			ТОГДА 24
		|		ИНАЧЕ 23
		|	КОНЕЦ КАК ИндексКартинки
		|ИЗ
		|	РегистрСведений.SUI_ВладельцыНастроекДокументов КАК ВладельцыНастроекДокументов
		|ГДЕ
		|	ВладельцыНастроекДокументов.НастройкаДокумента В (&НастройкиДокументов)
		|	И НЕ ВладельцыНастроекДокументов.МобильноеУстройство.ПометкаУдаления";
		
		Если Не Запрос.Параметры.Свойство("НастройкиДокументов") Тогда
			
			Если ЗначениеЗаполнено(ДокументОбмена) Тогда
				Запрос.УстановитьПараметр("НастройкиДокументов", ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(
					ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОбмена, "НастройкаДокумента")));
			ИначеЕсли ЗначениеЗаполнено(ДокументОснование) Тогда
				Запрос.УстановитьПараметр("НастройкиДокументов", Справочники.SUI_НастройкиДокументовОбмена.НастройкиПоДокументу(ДокументОснование));
			Иначе
				Запрос.УстановитьПараметр("НастройкиДокументов", Новый Массив());
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Запрос.УстановитьПараметр("ДокументОбмена", 
		?(ЗначениеЗаполнено(ДокументОбмена), ДокументОбмена, Неопределено));
		
	Запрос.УстановитьПараметр("ДокументОснование", 
		?(ЗначениеЗаполнено(ДокументОснование), SUI_ИнтеграцияВКонфигурацию.ИдентификаторSimpleПоСсылке(ДокументОснование), Неопределено));
		
	Запрос.УстановитьПараметр("СостоянияДокументовОбмена", СостоянияДокументовОбмена);
	Запрос.УстановитьПараметр("ОтборПоСостоянию", Запрос.Параметры.СостоянияДокументовОбмена.Количество() > 0);
	
	Запрос.УстановитьПараметр("ИсключаемыеСостоянияДокументовОбмена", ИсключаемыеСостоянияДокументовОбмена);
	Запрос.УстановитьПараметр("ОтборПоИсключаемымСостояниям", Запрос.Параметры.ИсключаемыеСостоянияДокументовОбмена.Количество() > 0);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Если Не РезультатыЗапроса[0].Пустой() Тогда
		
		Выборка = РезультатыЗапроса[0].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка.Следующий() Цикл
			
			СтрокаДерева = ДеревоВыборДанных.ПолучитьЭлементы().Добавить();
			СтрокаДерева.НастройкаДокумента = Выборка.НастройкаДокумента;
			
			ДетальныеЗаписи = Выборка.Выбрать();
			
			Пока ДетальныеЗаписи.Следующий() Цикл
				
				СтрокаДерева.ПредставлениеСтроки = ДетальныеЗаписи.НастройкаДокументаПредставление;
				СтрокаДерева.ИндексКартинки = ДетальныеЗаписи.НастройкаДокументаИндексКартинки;
				
				Если Не ДетальныеЗаписи.ДокументОбмена.Пустая() Тогда
					
					СтрокаДетальныеЗаписи = СтрокаДерева.ПолучитьЭлементы().Добавить();
					СтрокаДетальныеЗаписи.НастройкаДокумента = СтрокаДерева.НастройкаДокумента;
					СтрокаДетальныеЗаписи.ДокументОбмена = ДетальныеЗаписи.ДокументОбмена;
					СтрокаДетальныеЗаписи.ПредставлениеСтроки = ДетальныеЗаписи.ДокументОбменаПредставление;
					СтрокаДетальныеЗаписи.ИндексКартинки = ДетальныеЗаписи.ДокументОбменаИндексКартинки;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		Если Элементы.ГруппаВладельцыНастроекДокументов.Видимость И РезультатыЗапроса.ВГраница() > 0 Тогда
			ВладельцыНастроекДокументов.Загрузить(РезультатыЗапроса[1].Выгрузить());
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаАвтоВыбор()
	
	Если Не АвтоВыбор Тогда
		Возврат;
	КонецЕсли;
	
	ЭлементыРодитель = ДеревоВыборДанных.ПолучитьЭлементы();
	
	Если ЭлементыРодитель.Количество() > 0 И
		((ВыборОдного И ЭлементыРодитель.Количество() = 1 И ЭлементыРодитель[0].ПолучитьЭлементы().Количество() = 1) Или
		Не ВыборОдного) Тогда
		
		УстановитьВсеПометкиДереваВыбора(ДеревоВыборДанных);
		
		Для Каждого ВладелецНастройкиДокумента Из ВладельцыНастроекДокументов Цикл
			ВладелецНастройкиДокумента.Пометка = Истина;
		КонецЦикла;
		
		ЗакрытьСВыбором();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВсеПометкиДереваВыбора(Дерево)
	
	Для Каждого ЭлементДерева Из Дерево.ПолучитьЭлементы() Цикл
		ЭлементДерева.Пометка = 1;
		УстановитьВсеПометкиДереваВыбора(ЭлементДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеПометкиДереваВыбора(Дерево)
	
	Для Каждого ЭлементДерева Из Дерево.ПолучитьЭлементы() Цикл
		ЭлементДерева.Пометка = 0;
		СнятьВсеПометкиДереваВыбора(ЭлементДерева);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВниз(ДанныеСтроки)
	
	Значение = ДанныеСтроки.Пометка;
	
	Для Каждого Потомок Из ДанныеСтроки.ПолучитьЭлементы() Цикл
		
		Потомок.Пометка = Значение;
		
		ПроставитьПометкиВниз(Потомок);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроставитьПометкиВверх(ДанныеСтроки)
	
	РодительСтроки = ДанныеСтроки.ПолучитьРодителя();
	
	Если РодительСтроки <> Неопределено Тогда
		
		ВсеИстина = Истина;
		НеВсеЛожь = Ложь;
		
		Для Каждого Потомок Из РодительСтроки.ПолучитьЭлементы() Цикл
			ВсеИстина = ВсеИстина И (Потомок.Пометка = 1);
			НеВсеЛожь = НеВсеЛожь Или Булево(Потомок.Пометка);
		КонецЦикла;
		
		Если ВсеИстина Тогда
			РодительСтроки.Пометка = 1;
		ИначеЕсли НеВсеЛожь Тогда
			РодительСтроки.Пометка = 2;
		Иначе
			РодительСтроки.Пометка = 0;
		КонецЕсли;
		
		ПроставитьПометкиВверх(РодительСтроки);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажкиМобильныеУстройства(Пометка)
	
	Если Элементы.ДеревоВыборДанных.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОтборСтрок = Новый Структура();
	ОтборСтрок.Вставить("НастройкаДокумента", Элементы.ДеревоВыборДанных.ТекущиеДанные.НастройкаДокумента);
	
	Для Каждого СтрокаВладелец Из ВладельцыНастроекДокументов.НайтиСтроки(ОтборСтрок) Цикл
		СтрокаВладелец.Пометка = Пометка;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьСВыбором()
	
	ДанныеВыбора = Новый Соответствие();
	
	ЕстьОшибки = Ложь;
	
	Для Каждого СтрокаВыбора Из ДеревоВыборДанных.ПолучитьЭлементы() Цикл
		
		Если СтрокаВыбора.Пометка = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ДанныеВыбораПоНастройке = Новый Структура();
		
		ВладельцыНастроекВыбор = Новый Массив();
		
		Если Элементы.ГруппаВладельцыНастроекДокументов.Видимость Тогда
			
			ОтборВладельцевНастроекВыбор = Новый Структура();
			ОтборВладельцевНастроекВыбор.Вставить("НастройкаДокумента", СтрокаВыбора.НастройкаДокумента);
			ОтборВладельцевНастроекВыбор.Вставить("Пометка", Истина);
			Для Каждого ВыбранныйВладелец Из ВладельцыНастроекДокументов.НайтиСтроки(ОтборВладельцевНастроекВыбор) Цикл
				ВладельцыНастроекВыбор.Добавить(ВыбранныйВладелец.МобильноеУстройство);
			КонецЦикла;
			
			Если ВладельцыНастроекВыбор.Количество() = 0 И ОбязателенВыборМобильныхУстройств Тогда
				
				ОтборВладельцевНастроекВыбор.Пометка = Ложь;
				Если ВладельцыНастроекДокументов.НайтиСтроки(ОтборВладельцевНастроекВыбор).Количество() > 0 Тогда
					ТекстПредупреждения = СтрШаблон(НСтр("ru = 'Для настройки %1 не выбраны мобильные устройства'"), 
						СтрокаВыбора.НастройкаДокумента);
					ПоказатьПредупреждение(, ТекстПредупреждения);
					ЕстьОшибки = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
		
		КонецЕсли;
		
		ДанныеВыбораПоНастройке.Вставить("ВыбранныеМобильныеУстройства", Новый ФиксированныйМассив(ВладельцыНастроекВыбор));
		
		ДанныеВыбораПоНастройке.Вставить("ДоступенВыборДокументовОбмена", Ложь);
		
		ДокументыОбменаВыбор = Новый Массив();
		Для Каждого СтрокаВыбораДетальныеЗаписи Из СтрокаВыбора.ПолучитьЭлементы() Цикл
			
			ДанныеВыбораПоНастройке.ДоступенВыборДокументовОбмена = Истина;
			
			Если СтрокаВыбора.Пометка = 1 И Не СтрокаВыбораДетальныеЗаписи.ДокументОбмена.Пустая() Тогда
				ДокументыОбменаВыбор.Добавить(СтрокаВыбораДетальныеЗаписи.ДокументОбмена);
			КонецЕсли;
			
		КонецЦикла;
		
		ДанныеВыбораПоНастройке.Вставить("ВыбранныеДокументыОбмена", Новый ФиксированныйМассив(ДокументыОбменаВыбор));
		
		ДанныеВыбора.Вставить(СтрокаВыбора.НастройкаДокумента, Новый ФиксированнаяСтруктура(ДанныеВыбораПоНастройке));
		
	КонецЦикла;
	
	Если Не ЕстьОшибки И ДанныеВыбора.Количество() = 0 Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Не выбраны данные'"));
		ЕстьОшибки = Истина;
	КонецЕсли;
	
	Если Не ЕстьОшибки Тогда
		Закрыть(Новый ФиксированноеСоответствие(ДанныеВыбора));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьПослеПредупреждения(ДополнительныеПараметры) Экспорт
	Закрыть();
КонецПроцедуры

#КонецОбласти
